---
kind: type
id: T:Autodesk.Revit.DB.Visual.PlasticvinylPatternType
source: html/e70d0d72-3e57-dcdd-dc5c-e786bc8924d1.htm
---
# Autodesk.Revit.DB.Visual.PlasticvinylPatternType

The enumerated type representing the permitted values for the asset property "PlasticvinylPattern" from the "PlasticVinyl" schema.

## Syntax (C#)
```csharp
public enum PlasticvinylPatternType
```